{
  "intro": "People say I talk a lot 🤷‍♂️. I love programming 🖥, travelling 🚂, exploring new places 🌍, new cuisines 🍜, and music 🎶",
  "end": "Appreciate your valuable time, if you have anything to say feel free to drop a message. I really like people who tell jokes and talk about science.",
  "careerInfo": [
    {
      "time": "Feb, 2018",
      "company": "Transforming Systems",
      "Type": "Job",
      "Description": "As a polyglot developer, I help the organisation to co-design and develop many real-time systems and services to NHS partners. Currently, the development provides intelligence systems based on real-time data for 26 CCGs across England, covering multiple providers including primary care, acute hospitals, 111, ambulance services, secondary care, etc. Technologies involved in the project development are Spring Boot, Angular, Mongo, MySQL, NodeJS, Mobile application development, Devops etc.",
      "title": "Polyglot Developer"
    },
    {
      "time": "Jan, 2018",
      "company": "University of Greenwich",
      "Type": "Student",
      "Description": "Graduated with a Masters degree in the field of Computer Science from University of Greenwich",
      "title": "Graduated (Masters)"
    },
    {
      "time": "Nov, 2018",
      "company": "University of Greenwich",
      "Type": "Job",
      "Description": "As a software developer, I helped the organisation to build a crisis management platform named Pandora+. It is the project being developed by University of Greenwich in conjunction with T4R and is based on the Pandora System developed as a result of the EU FP7 project, grant agreement 225387, funding Scheme. Project development involves TDD development process and the technologies involved in this project are Spring Boot, Angular, Docker and Google Cloud Platform. Some of the key responsibilities include.",
      "title": "Software Developer"
    },
    {
      "time": "Jul, 2018",
      "company": "University of Greenwich",
      "Type": "Job",
      "Description": "As a full-stack developer, worked on a mobile based application and its backend. This project is intended to build an application, to help people in the drought regions of countries in Africa, by fetching nearby water bodies based on the current location. Technologies involved in this project are NodeJS, MySQL, Restful API, Android application.",
      "title": "Software Developer"
    },
    {
      "time": "Mar, 2015",
      "company": "Startups",
      "Type": "Job",
      "Description": "It was okay, made some money helped me to fund my startups for an extent, along with my masters fee.",
      "title": "Released Second Game iOS only."
    },
    {
      "time": "Aug, 2014",
      "company": "Startups",
      "Type": "Job",
      "Description": "A failed attempt to create a money generation model for my startups.",
      "title": "Released First Game."
    },
    {
      "time": "Jun, 2014",
      "company": "Startups",
      "Type": "Job",
      "Description": "Worked on several ideas involving iOS application development, Android application development, Restful API, NodeJS, NoSQL, MySQL, Artificial Intelligence, Web Spider using Python and AWS.",
      "title": "Software Engineer"
    },
    {
      "time": "Mar, 2012",
      "company": "Tata Consultancy Services",
      "Type": "Job",
      "Description": "Worked as a Mainframe programmer for American Express, handling several projects in relation to different geographic locations.",
      "title": "Systems Engineer"
    },
    {
      "time": "Jun, 2011",
      "company": "CVR College of Engineering",
      "Type": "Student",
      "Description": "Graduated with a Bachelors degree in the field of Electronics and Communication Engineering from Jawaharlal Nehru Institute of Technology Hyderabad",
      "title": "Graduated (Bachelors)"
    }
  ],
  "projectInfo": [
    {
      "url": "https://github.com/TejaBeta/Bolt",
      "title": "ToDo list tray application using Electron."
    },
    {
      "url": "https://github.com/TejaBeta/tejabeta-2.0",
      "title": "My Portfolio Version 2.0"
    },
    {
      "url": "https://github.com/TejaBeta/Magic-touch-bar",
      "title": "Magic touch bar for Macbook Pro using Electron."
    },
    {
      "url": "https://github.com/TejaBeta/TFL-Disruptor",
      "title": "TFL Disruptor using Python and Angular."
    }
  ],

  "techStack": {
    "languages": ["Python", "Javascript", "Java", "C", "Swift", "COBOL"],
    "technologies": [
      "React",
      "Angular",
      "Sprint Boot",
      "NodeJS",
      "Django",
      "Docker",
      "MySQL & Mongo",
      "Tornedo"
    ]
  }
}
